# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [10]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [5]:
# your answer here
employee = pd.read_csv('data/employee.csv');
time_grades = pd.read_csv('data/Time_Grades.csv');

In [9]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [11]:
# Method 1
# your answer here
# Group By
employee.groupby(['Department']).agg({'Salary':np.mean}).reset_index()

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

In [15]:
# Pivot Table
employee.pivot_table(index= ['Department'])

/var/folders/n7/3f1mct1521j5vz1r2r1xwby80000gn/T/ipykernel_66926/2095400330.py:2: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  employee.pivot_table(index= ['Department'])

            Salary     Years
Department
HR           45.00  4.666667
IT           48.75  4.500000
Sales        55.00  2.500000

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [17]:
# Method 2
# your answer here
employee.pivot_table(index= ['Department'],columns=['Title'])

/var/folders/n7/3f1mct1521j5vz1r2r1xwby80000gn/T/ipykernel_66926/49727272.py:3: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  employee.pivot_table(index= ['Department'],columns=['Title'])

           Salary                   Years
Title          VP analyst associate    VP analyst associate
Department
HR           70.0    32.5       NaN   8.0     3.0       NaN
IT           70.0    32.5      60.0   8.0     1.5       7.0
Sales         NaN     NaN      55.0   NaN     NaN       2.5

In [21]:
# your answer here
employee.groupby(['Department', 'Title']).agg({'Salary':np.mean})

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [ ]:
superstore.pivot_table(index= ['Category','Region'], values = ['Sales','Profit'], aggfunc = ['sum','mean'])
df = superstore.pivot_table(index= ['Category','Region'], values = ['Sales','Profit'], aggfunc = {'Sales':['sum','mean'],'Profit':'mean'}).reset_index()
df.head()
df.columns = ['Category','Region', 'MeanProfit', 'MeanSales', 'TotalSales']
df

In [28]:
# your answer here
employee.pivot_table(index= ['Title'],columns=['Years', 'Salary'], aggfunc = ['sum','mean'])

employee_pivot = employee.pivot_table(index='Title', values=['Years', 'Salary'], aggfunc={'Years': 'mean', 'Salary': 'mean'})

employee_pivot.head()

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [43]:
# your answer here
employee = pd.read_csv('data/employee.csv');
employee_pivot2 = employee.pivot_table(index=['Department', 'Title'], values=['Salary', 'Name'], aggfunc={'Salary': 'mean', 'Name': 'count'})
employee_pivot2.rename(columns={'Name': 'n of employees'}, inplace=True)

employee_pivot2.head()

                      n of employees  Salary
Department Title
HR         VP                      1    70.0
           analyst                 2    32.5
IT         VP                      1    70.0
           analyst                 2    32.5
           associate               1    60.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [52]:
employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = {'Salary':['median','min','max','std']})
# HR has a wider range of salary than the other two departments. it seems that the salary are more left ditributed 
# So it seems that there are few people that earn very much. IT wages seem to be more normal distributed
# While it seems we do not have enough data for sales to make some assumption

           Salary
              max median min        std
Department
HR             70   35.0  30  21.794495
IT             70   47.5  30  19.311050
Sales          55   55.0  55   0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [49]:
employee.pivot_table(index= ['Title'], values = ['Salary'], aggfunc = {'Salary':['median','min','max','std']})
# We can conclude that we do not have enough data for VP, Analyst wages it low and well distributed. Associate wage is left distributed

          Salary
             max median min       std
Title
VP            70   70.0  70  0.000000
analyst       35   32.5  30  2.886751
associate     60   55.0  55  2.886751

In [ ]:
# your answer here
# standard deviation is 0 because we do not have enough data maybe one or two identical entry?

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [56]:
# your answer here
employee_pivot3 = employee.pivot_table(index=['Department'], values=['Salary', 'Name'], aggfunc={'Salary': 'sum', 'Name': 'count'})

employee_pivot3.rename(columns={'Name': 'n of employees'}, inplace=True)

employee_pivot3.head()

            n of employees  Salary
Department
HR                       3     135
IT                       4     195
Sales                    2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [57]:
# your answer here
employee_pivot4 = employee.pivot_table(index=['Department', 'Title'], values=['Salary', 'Years'], aggfunc={'Salary': 'mean', 'Years': 'sum'})

employee_pivot4.head()

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here